In [1]:
import pandas as pd
import numpy as np

In [9]:
student=pd.read_csv('C:\\Users\\GPTINF05\\Documents\\riwan.csv')
mark=pd.read_csv('C:\\Users\\GPTINF05\\Documents\\student.csv')
df_merge=pd.merge(student,mark,on='student_id')
df_merge

   student_id     name  subject  m1   m2  m3
0           1     Riwan  Python  89  100  96
1           2  Harshith    Java  79   90  47
2           3     Adlin   Maths  56   78  67
3           4     Shane    DBMS  57   58  94
4           5    Chatan  Social  78   60  67